## Aim: Perform data preprocessing using created dataframe using pandas
## and answer the following questions:
1. Count missing values in columns.
2. Count missing values in each row.
3. Add new row in dataframe.
4. Remove duplicate values.
5. Use of fill function for all column and one column[0,-99,value,Name].
6. Use of Replace function.
7. Use of mode,median and mean function.
8. Use of bfill,ffill in numeric dataframe.
9. Use of mode function for categorical dataframe.

Dataset 1 - categorical

In [2]:
import numpy as np
import pandas as pd
students=[('Prakshil',22,'Ahmedabad','Adani'),
          ('Dharmik',np.nan,'Ahmedabad','Adani'),
          ('Jay', 21, 'Surat', 'Reliance'),
          ('Dhruv', np.nan, 'Vadodara', np.nan),
          ('Rahul', 23, np.nan, 'Tata'),
          ('Amit', 25, 'Pune', 'Infosys'),
          ('Bhavin', np.nan, 'Bangalore', 'Wipro'),
          ('Chirag', 20, 'Mumbai', np.nan),
          ('namra', np.nan, 'London', 'Microsoft'),
          ('vatsal', np.nan, 'Sydney', 'Atlassian'),
          (np.nan,np.nan,np.nan,'yahoo')]

Dataset 2 - numerical

In [25]:
data = {
    'A':[24,90,78,np.nan],
    'B':[34,93,np.nan,56],
    'c':[2,45,78,np.nan],
    'D':[np.nan,9,71,np.nan],
    'E':[12,np.nan,88,59],
    'F':[82,np.nan,82,59],
    'G':[87,33,37,67],
}

dc = pd.DataFrame(data)
dc

      A     B     c     D     E     F   G
0  24.0  34.0   2.0   NaN  12.0  82.0  87
1  90.0  93.0  45.0   9.0   NaN   NaN  33
2  78.0   NaN  78.0  71.0  88.0  82.0  37
3   NaN  56.0   NaN   NaN  59.0  59.0  67

In [4]:
df  = pd.DataFrame(students, columns=['name','age','city','company'], index=['a','b','c','d','e','f','g','h','i','j','k'])

In [5]:
df

       name   age       city    company
a  Prakshil  22.0  Ahmedabad      Adani
b   Dharmik   NaN  Ahmedabad      Adani
c       Jay  21.0      Surat   Reliance
d     Dhruv   NaN   Vadodara        NaN
e     Rahul  23.0        NaN       Tata
f      Amit  25.0       Pune    Infosys
g    Bhavin   NaN  Bangalore      Wipro
h    Chirag  20.0     Mumbai        NaN
i     namra   NaN     London  Microsoft
j    vatsal   NaN     Sydney  Atlassian
k       NaN   NaN        NaN      yahoo

Calculate missing values in each column or display a boolena matrix

In [6]:
print("For the boolean matrix",df.isnull())

For the boolean matrix     name    age   city  company
a  False  False  False    False
b  False   True  False    False
c  False  False  False    False
d  False   True  False     True
e  False  False   True    False
f  False  False  False    False
g  False   True  False    False
h  False  False  False     True
i  False   True  False    False
j  False   True  False    False
k   True   True   True    False

Calculate missing values in each column

In [7]:
print("total NaN at each column in dataframe:",df.isnull().sum())

total NaN at each column in dataframe: name       1
age        6
city       2
company    2
dtype: int64


Calculate total missing values in whole dataframe

In [29]:
print(df.isnull().sum().sum())

13

Add a new row to dataframe

In [8]:
df.loc[len(df.index)]=['Dharmik',20,'Mehsana','capegemini']

In [9]:
df

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik   NaN  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv   NaN   Vadodara         NaN
e      Rahul  23.0        NaN        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin   NaN  Bangalore       Wipro
h     Chirag  20.0     Mumbai         NaN
i      namra   NaN     London   Microsoft
j     vatsal   NaN     Sydney   Atlassian
k        NaN   NaN        NaN       yahoo
11   Dharmik  20.0    Mehsana  capegemini

Calculate missing values in each row

In [10]:
for i in range(len(df.index)):
  print("total NaN in row",i+1,":",df.iloc[i].isnull().sum())

total NaN in row 1 : 0
total NaN in row 2 : 1
total NaN in row 3 : 0
total NaN in row 4 : 2
total NaN in row 5 : 1
total NaN in row 6 : 0
total NaN in row 7 : 1
total NaN in row 8 : 1
total NaN in row 9 : 1
total NaN in row 10 : 1
total NaN in row 11 : 3
total NaN in row 12 : 0

Check whether any row in dataframe is duplicate or not

In [30]:
df.loc[len(df.index)]=['Dharmik',20,'Mehsana','capegemini']

In [31]:
df.duplicated
print(df.duplicated())

a     False
b     False
c     False
d     False
e     False
f     False
g     False
h     False
i     False
j     False
k     False
11    False
12    False
13     True
dtype: bool

Remove the duplicated rows

In [32]:
df = df.drop_duplicates()
print(df)

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik   NaN  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv   NaN   Vadodara         TCS
e      Rahul  23.0        NaN        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin   NaN  Bangalore       Wipro
h     Chirag  20.0     Mumbai         TCS
i      namra   NaN     London   Microsoft
j     vatsal   NaN     Sydney   Atlassian
k        NaN   NaN        NaN       yahoo
11   Dharmik  20.0    Mehsana  capegemini
12       NaN   NaN        NaN         NaN

In [12]:
df[0:5]

       name   age       city   company
a  Prakshil  22.0  Ahmedabad     Adani
b   Dharmik   NaN  Ahmedabad     Adani
c       Jay  21.0      Surat  Reliance
d     Dhruv   NaN   Vadodara       NaN
e     Rahul  23.0        NaN      Tata

In [13]:
df.fillna(0)

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik   0.0  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv   0.0   Vadodara           0
e      Rahul  23.0          0        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin   0.0  Bangalore       Wipro
h     Chirag  20.0     Mumbai           0
i      namra   0.0     London   Microsoft
j     vatsal   0.0     Sydney   Atlassian
k          0   0.0          0       yahoo
11   Dharmik  20.0    Mehsana  capegemini

In [14]:
df['company'].fillna('TCS',inplace=True)

In [15]:
df

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik   NaN  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv   NaN   Vadodara         TCS
e      Rahul  23.0        NaN        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin   NaN  Bangalore       Wipro
h     Chirag  20.0     Mumbai         TCS
i      namra   NaN     London   Microsoft
j     vatsal   NaN     Sydney   Atlassian
k        NaN   NaN        NaN       yahoo
11   Dharmik  20.0    Mehsana  capegemini

Fill missing values using ffill()

In [16]:
df.fillna(method='pad')

C:\Users\Prakshil\AppData\Local\Temp\ipykernel_13144\196241153.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik  22.0  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv  21.0   Vadodara         TCS
e      Rahul  23.0   Vadodara        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin  25.0  Bangalore       Wipro
h     Chirag  20.0     Mumbai         TCS
i      namra  20.0     London   Microsoft
j     vatsal  20.0     Sydney   Atlassian
k     vatsal  20.0     Sydney       yahoo
11   Dharmik  20.0    Mehsana  capegemini

Fill missing values using bfill()

In [17]:
df.fillna(method='bfill')

C:\Users\Prakshil\AppData\Local\Temp\ipykernel_13144\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik  21.0  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv  23.0   Vadodara         TCS
e      Rahul  23.0       Pune        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin  20.0  Bangalore       Wipro
h     Chirag  20.0     Mumbai         TCS
i      namra  20.0     London   Microsoft
j     vatsal  20.0     Sydney   Atlassian
k    Dharmik  20.0    Mehsana       yahoo
11   Dharmik  20.0    Mehsana  capegemini

Drop the rows if there is no data in it

In [18]:
df.loc[len(df.index)]=[np.nan,np.nan,np.nan,np.nan]

In [19]:
df.dropna(how='all')

        name   age       city     company
a   Prakshil  22.0  Ahmedabad       Adani
b    Dharmik   NaN  Ahmedabad       Adani
c        Jay  21.0      Surat    Reliance
d      Dhruv   NaN   Vadodara         TCS
e      Rahul  23.0        NaN        Tata
f       Amit  25.0       Pune     Infosys
g     Bhavin   NaN  Bangalore       Wipro
h     Chirag  20.0     Mumbai         TCS
i      namra   NaN     London   Microsoft
j     vatsal   NaN     Sydney   Atlassian
k        NaN   NaN        NaN       yahoo
11   Dharmik  20.0    Mehsana  capegemini

Drop the row if there is any nan value(s) in it

In [34]:
df = pd.DataFrame(data)
df.loc[len(df)] = [np.nan] * len(df.columns)
df.dropna(inplace=True)
print(df)

Empty DataFrame
Columns: [A, B, c, D, E, F, G]
Index: []

Find the mode and replace the nan values with it

In [26]:

mode_F = dc['F'].mode()[0]
dc['F'].fillna(mode_F, inplace=True)
display(dc)

      A     B     c     D     E     F   G
0  24.0  34.0   2.0   NaN  12.0  82.0  87
1  90.0  93.0  45.0   9.0   NaN  82.0  33
2  78.0   NaN  78.0  71.0  88.0  82.0  37
3   NaN  56.0   NaN   NaN  59.0  59.0  67

Find the median and replace the nan values with it

In [27]:
median_D = dc['D'].median()
dc['D'].fillna(median_D, inplace=True)
display(dc)

      A     B     c     D     E     F   G
0  24.0  34.0   2.0  40.0  12.0  82.0  87
1  90.0  93.0  45.0   9.0   NaN  82.0  33
2  78.0   NaN  78.0  71.0  88.0  82.0  37
3   NaN  56.0   NaN  40.0  59.0  59.0  67

Find the mean and replace the nan values with it

In [28]:
mean_B = dc['B'].mean()
dc['B'].fillna(mean_B, inplace=True)
display(dc)

      A     B     c     D     E     F   G
0  24.0  34.0   2.0  40.0  12.0  82.0  87
1  90.0  93.0  45.0   9.0   NaN  82.0  33
2  78.0  61.0  78.0  71.0  88.0  82.0  37
3   NaN  56.0   NaN  40.0  59.0  59.0  67

In [20]:
import numpy as np
import pandas as pd
cat_data={"A":["csgo","valorant","GTA","GTA","PUBG",np.nan,np.nan]}

In [21]:
dt = pd.DataFrame(cat_data)

In [22]:
mode_cat=dt['A'].mode()[0]

In [23]:
dt

          A
0      csgo
1  valorant
2       GTA
3       GTA
4      PUBG
5       NaN
6       NaN

Find the mode and replace the nan values with it

In [24]:
dt['A'].fillna(mode_cat, inplace=True)
display(dt)

          A
0      csgo
1  valorant
2       GTA
3       GTA
4      PUBG
5       GTA
6       GTA